Repository: Quebecca/qc_redirects
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: fr

source: Import redirects list
fr: Importer la liste des redirections

source: : colon
fr: : deux-points

source: , comma
fr: , virgule

source: | pipe
fr: | barre verticale

source: ; semicolon
fr: ; point-virgule

# separationCharacter
source: Fields separated by:
fr: Champs séparés par :

# enterRedirectsItems
source: Enter the redirects items
fr: Saisissez les redirections

# lCreate_msg1
source: You're about to import a list of redirects. Are you sure you want to continue?
fr: Vous êtes sur le point d'importer une liste de redirections. Êtes-vous sûr de vouloir continuer ?

# lReset
source: Clear fields
fr: Effacer les champs

# import_success_body
source: The list has been imported successfully
fr: La liste a correctement été importée

source: Success
fr: Succès

# duplicatedSourcePath
source: Error when importing the redirect list, the source path :
fr: Erreur lors de l'importation,

source: Error
fr: Erreur

source: is duplicated
fr: est dupliqué

# syntaxError
source: Error when importing the redirect list, please verify the importing syntax
fr: Erreur lors de l'importation. Veuillez vérifier la syntaxe d'importation

# invalidField
source: Invalid field(s) :
fr: Champ(s) invalides :

# import
source: Import the redirects list
fr: Importer la liste des redirections

# invalidValue
source: Invalid value inserted for the column
fr: Valeur non valide insérée pour la colonne

# emptyValue
source: Empty value inserted for the field :
fr: Valeur vide insérée pour le champ :

# readOnlyField
source: Field is on read only
fr: Le champs est pour la lecture seulement

source: Source host
fr: Domaine source

source: Source path
fr: Chemin source

source: Title
fr: Titre

source: Target
fr: Cible

# isRegularExpression
source: Is regular experssion
fr: Est-ce une expression régulière ?

# createdon
source: Creation date
fr: Date de création

# updatedon
source: Update date
fr: Date de modification

# label_title
source: Title
fr: Titre

# mandatoryFieldsDesc
source: The source_host, source_path, target and is_regexp value are required. the order of this fields is required.
fr: La valeur de champ source_host, source_path, target et is_regexp sont obligatoires. l'ordre de ces champs est obligatoire.

# regularExpressionValuesDesc
source: The "is_regexp" field can take only the values 'true' or 'false'
fr: Le champ "is_regexp" peut prendre uniquement les valeurs 'true' ou 'false'.

# optionalFields
source: The optional fields can be empty.
fr: Les champs optionnels peuvent être vides.

# optionalFieldsDesc
source: The optional fields have the same configuration(field name, value validation) as the fields used in the TCA configuration for the Redirect module, you can uses any order for this fields.
fr: Les champs optionnels portent la même configuration (nom de champ, validation de valeur) que les champs utilisés dans la configuration TCA de module Redirect. vous pouvez choisir l'ordre de ces champs.

source: Advanced
fr: Avancée

# extraFields
source: Additional field names (space comma) (title, starttime, endtime, target_statuscode, ...)
fr: Noms des champs supplémentaires (délimités par des virgules) (title, starttime, endtime, target_statuscode, ...)

source: Example :
fr: Exemple :
